<a href="https://colab.research.google.com/github/mlukan/GDA3B2021/blob/main/Martin_Lukan_Pandas_Part_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Mission 1

![](https://i.imgur.com/Ax3pp2A.png)


Create a "fruit" dataframe that reflects the above example **using a list** data structure

[This resource could help you.](https://www.geeksforgeeks.org/create-a-pandas-dataframe-from-lists/)

In [2]:
import pandas as pd
fruit=pd.DataFrame([[30,21]],columns=['Apples','Bananas'])
fruit

   Apples  Bananas
0      30       21

# Mission 2

Create a "fruit_vendors" dataframe that reflects the below example **using a dictionary** data structure

![](https://i.imgur.com/CHPn7ZF.png)

[This resource could help you.](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.from_dict.html)

In [7]:
fruit_vendors=pd.DataFrame.from_dict({"Apples":{'2017 Sales':35,"2018 Sales":41},"Bananas":{"2017 Sales":21,"2018 Sales":34}})
fruit_vendors

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

# Mission 3

Use a loop to display the values from each column in the dataframe from mission 2.

In [14]:
for i in fruit_vendors:
  print(fruit_vendors[i])

2017 Sales    35
2018 Sales    41
Name: Apples, dtype: int64
2017 Sales    21
2018 Sales    34
Name: Bananas, dtype: int64

# Mission 4

Delete line 1 of the dataframe from mission 2

[This resource could help you.](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

In [15]:
fruit_vendors.drop('2017 Sales')

            Apples  Bananas
2018 Sales      41       34

# Mission 5

Delete column 1 from the dataframe from mission 2.

In [16]:
fruit_vendors.drop(columns='Apples')

            Bananas
2017 Sales       21
2018 Sales       34

In [19]:
fruit_vendors.drop(fruit_vendors.columns[0],axis = 1)

            Bananas
2017 Sales       21
2018 Sales       34